ERP.belugaerp/src/InformationRegisters/ДатыЗапретаИзменения/ДатыЗапретаИзменения.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>ДатыЗапретаИзменения</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <informationRegisterPeriodicity>Checked</informationRegisterPeriodicity>
    <writeMode>Checked</writeMode>
  </extension>
  <resources>
    <name>ДатаЗапрета</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <attributes>
    <name>ОписаниеДатыЗапрета</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>1000</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>1000</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <dimensions>
    <name>Раздел</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions>
    <name>Объект</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions>
    <name>Пользователь</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
</mdclass:InformationRegister>

ERP.belugaerp/src/InformationRegisters/бг_ИсторияИзмененийЗапретаРедактирования/бг_ИсторияИзмененийЗапретаРедактирования.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>бг_ИсторияИзмененийЗапретаРедактирования</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>ДатаЗапретаДо</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>ДатаЗапретаПосле</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ОписаниеДатыЗапрета</name>
    <comment>Описание относительной даты запрета, используемое для вычисления даты запрета на текущую дату</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1000</length>
      </stringQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
      <types>EnumRef.ВидыНазначенияДатЗапрета</types>
      <types>CatalogRef.ГруппыПользователей</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Раздел</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.РазделыДатЗапретаИзменения</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Объект</name>
    <type>
      <types>CatalogRef.Организации</types>
      <types>ChartOfCharacteristicTypesRef.РазделыДатЗапретаИзменения</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ПользовательКонечный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
      <types>EnumRef.ВидыНазначенияДатЗапрета</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

ERP.belugaerp/src/InformationRegisters/СоставыГруппПользователей/СоставыГруппПользователей.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>СоставыГруппПользователей</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <informationRegisterPeriodicity>Checked</informationRegisterPeriodicity>
    <writeMode>Checked</writeMode>
  </extension>
  <resources>
    <name>Используется</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <dimensions>
    <name>ГруппаПользователей</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions>
    <name>Пользователь</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
</mdclass:InformationRegister>

ERP.belugaerp/src/InformationRegisters/ДатыЗапретаИзменения/RecordSetModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

&После("ПередЗаписью")
Процедура бг_ПередЗаписью(Отказ, Замещение)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если Отбор.Пользователь.Использование Тогда

		Запрос = бг_ЗапросИсторияИзмененийЗапретаРедактирования();
		Выборка = Запрос.Выполнить().Выбрать();
		
		РегистрыСведений.бг_ИсторияИзмененийЗапретаРедактирования.ЗаписатьДанные(Выборка);
		
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция бг_ЗапросИсторияИзмененийЗапретаРедактирования()

	Пользователь = Отбор.Пользователь.Значение;
	Раздел = Отбор.Раздел.Значение;
	Объект = Отбор.Объект.Значение;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ДатыЗапретаИзменения.Раздел КАК Раздел,
	|	ДатыЗапретаИзменения.Объект КАК Объект,
	|	ДатыЗапретаИзменения.Пользователь КАК Пользователь,
	|	ДатыЗапретаИзменения.ДатаЗапрета КАК ДатаЗапрета,
	|	ДатыЗапретаИзменения.ОписаниеДатыЗапрета КАК ОписаниеДатыЗапрета,
	|	ДатыЗапретаИзменения.Комментарий КАК Комментарий
	|ПОМЕСТИТЬ ДатыЗапретаИзменения
	|ИЗ
	|	&ДатыЗапретаИзменения КАК ДатыЗапретаИзменения
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДатыЗапретаИзменения.Раздел КАК Раздел,
	|	ДатыЗапретаИзменения.Объект КАК Объект,
	|	ДатыЗапретаИзменения.Пользователь КАК ГруппаПользователей,
	|	СоставыГруппПользователей.Пользователь КАК Пользователь,
	|	ДатыЗапретаИзменения.ДатаЗапрета КАК ДатаЗапретаДо,
	|	ДатыЗапретаИзменения.ОписаниеДатыЗапрета КАК ОписаниеДатыЗапретаДо,
	|	НЕОПРЕДЕЛЕНО КАК ДатаЗапретаПосле,
	|	НЕОПРЕДЕЛЕНО КАК ОписаниеДатыЗапретаПосле,
	|	NULL КАК Комментарий
	|ПОМЕСТИТЬ ДатыЗапретаИзмененияДоПосле
	|ИЗ
	|	РегистрСведений.ДатыЗапретаИзменения КАК ДатыЗапретаИзменения
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СоставыГруппПользователей КАК СоставыГруппПользователей
	|		ПО ДатыЗапретаИзменения.Пользователь = СоставыГруппПользователей.ГруппаПользователей
	|			И (СоставыГруппПользователей.Используется)
	|ГДЕ
	|	ДатыЗапретаИзменения.Пользователь = &Пользователь
	|	И ДатыЗапретаИзменения.Раздел = &Раздел
	|	И ДатыЗапретаИзменения.Объект = &Объект
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ДатыЗапретаИзменения.Раздел,
	|	ДатыЗапретаИзменения.Объект,
	|	ДатыЗапретаИзменения.Пользователь,
	|	СоставыГруппПользователей.Пользователь,
	|	НЕОПРЕДЕЛЕНО,
	|	НЕОПРЕДЕЛЕНО,
	|	ДатыЗапретаИзменения.ДатаЗапрета,
	|	ДатыЗапретаИзменения.ОписаниеДатыЗапрета,
	|	ДатыЗапретаИзменения.Комментарий
	|ИЗ
	|	ДатыЗапретаИзменения КАК ДатыЗапретаИзменения
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СоставыГруппПользователей КАК СоставыГруппПользователей
	|		ПО ДатыЗапретаИзменения.Пользователь = СоставыГруппПользователей.ГруппаПользователей
	|			И (СоставыГруппПользователей.Используется)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДатыЗапретаИзменения.Раздел КАК Раздел,
	|	ДатыЗапретаИзменения.Объект КАК Объект,
	|	&Пользователь КАК Пользователь,
	|	ДатыЗапретаИзменения.Пользователь КАК ПользовательКонечный,
	|	МАКСИМУМ(ДатыЗапретаИзменения.ДатаЗапретаДо) КАК ДатаЗапретаДо,
	|	МАКСИМУМ(ДатыЗапретаИзменения.ОписаниеДатыЗапретаДо) КАК ОписаниеДатыЗапретаДо,
	|	МАКСИМУМ(ДатыЗапретаИзменения.ДатаЗапретаПосле) КАК ДатаЗапретаПосле,
	|	МАКСИМУМ(ДатыЗапретаИзменения.ОписаниеДатыЗапретаПосле) КАК ОписаниеДатыЗапретаПосле,
	|	МАКСИМУМ(ДатыЗапретаИзменения.Комментарий) КАК Комментарий,
	|	МАКСИМУМ(ДатыЗапретаИзменения.ГруппаПользователей) КАК ГруппаПользователей
	|ИЗ
	|	ДатыЗапретаИзмененияДоПосле КАК ДатыЗапретаИзменения
	|
	|СГРУППИРОВАТЬ ПО
	|	ДатыЗапретаИзменения.Раздел,
	|	ДатыЗапретаИзменения.Объект,
	|	ДатыЗапретаИзменения.Пользователь
	|
	|ИМЕЮЩИЕ
	|	(МАКСИМУМ(ДатыЗапретаИзменения.ДатаЗапретаДо) <> МАКСИМУМ(ДатыЗапретаИзменения.ДатаЗапретаПосле)
	|		ИЛИ МАКСИМУМ(ДатыЗапретаИзменения.ОписаниеДатыЗапретаДо) <> МАКСИМУМ(ДатыЗапретаИзменения.ОписаниеДатыЗапретаПосле))";
	
	Запрос.УстановитьПараметр("Пользователь", Пользователь);
	Если Отбор.Раздел.Использование Тогда
		Запрос.УстановитьПараметр("Раздел", Раздел);
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "И ДатыЗапретаИзменения.Раздел = &Раздел", "");
	КонецЕсли;
	Если Отбор.Объект.Использование Тогда
		Запрос.УстановитьПараметр("Объект", Объект);
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "И ДатыЗапретаИзменения.Объект = &Объект", "");
	КонецЕсли;
	Запрос.УстановитьПараметр("ДатыЗапретаИзменения", ЭтотОбъект.Выгрузить());

	Возврат Запрос;
	
КонецФункции

#КонецОбласти

#КонецЕсли
